source("generate.r")

x11 = generate(7, 2, 4, 7, 0)
x12 = generate(7, 2, 4, 7, 2)
x13 = generate(7, 2, 4, 7, 5)
x14 = generate(7, 2, 4, 7, 7)

x21 = generate(125, 6, 17, 100, 0)
x22 = generate(125, 6, 17, 100, 2)
x23 = generate(125, 6, 17, 100, 5)
x24 = generate(125, 6, 17, 100, 7)

x31 = generate(2^15-1, 1664525, 1013904223, 1000, 0)
x32 = generate(2^15-1, 1664525, 1013904223, 1000, 2)
x33 = generate(2^15-1, 1664525, 1013904223, 1000, 5)
x34 = generate(2^15-1, 1664525, 1013904223, 1000, 7)

x41 = generate(2^31-1, 48271, 0, 10000, 0)
x42 = generate(2^31-1, 48271, 0, 10000, 2)
x43 = generate(2^31-1, 48271, 0, 10000, 5)
x44 = generate(2^31-1, 48271, 0, 10000, 7)

x51 = generate(2^32-1, 253801, 14519, 10000, 0)
x52 = generate(2^32-1, 253801, 14519, 10000, 2)
x53 = generate(2^32-1, 253801, 14519, 10000, 5)
x54 = generate(2^32-1, 253801, 14519, 10000, 7)


v = runif(100, 0, 2^30)

print("математическое ожидание:")
print(mean(v))
print("идеальное:")
print(2^30/2)

print("дисперсия:")
print(var(v))

hist(v, freq = FALSE, col = "lightblue",
     xlab = "вектор значений",
     ylab = "плотность вероятности",
     main = "гистограмма, совмещённая с кривой плотности")
lines(density(v), col = "red", lwd = 2)


plot(c(x11, x12, x13, x14,
       x21, x22, x23, x24,
       x31, x32, x33, x34,
       x41, x42, x43, x44,
       x51, x52, x53, x54))
