{
  "data": "Самый простой способ - это так называемый чип-тюнинг. Название происходит от английского chip - микросхема. Пойти по этому пути можно, только если двигатель имеет впрыск с электронным управлением. Никаких механических переделок не требуется, суть чип-тюнинга - в замене программы блока управления двигателем путем перепрограммирования или замены микросхемы - чипа. При этом изменяется алгоритм управления впрыском и опережением зажигания.\nЭтим способом мощность мотора можно поднять на 5-10%. Но не безболезненно - практикуемая в таких случаях отмена ограничения максимальных оборотов ведет к повышению износа двигателя, а увеличение подачи топлива на переходных режимах подразумевает увеличение его расхода. Наибольший эффект 'чип-тюнинг' дает на турбированных двигателях, особенно на турбодизелях, где есть возможность повысить давление наддува.\nВ карбюраторных двигателях повышения мощности можно добиться соответствующей заменой жиклеров в карбюраторе. Последствия те же. Кроме того, при этом способе увеличение мощности 'на верхах' часто приводит к ее падению на 'низах', а то и в 'середине', которая наиболее часто используется в повседневном передвижении на автомобиле.\nспортивный распредвал\nСледующий этап форсировки двигателя требует механического вмешательства. Например, можно заменить распредвал. Первый вариант - установить т. н. спортивный распредвал, с более острым профилем кулачков. Такой профиль обеспечивает большую величину открытия клапанов, что улучшает газообмен и, следовательно, повышает мощность. Правда, увеличиваются и нагрузки на механизм газораспределения, тем более, что для предотвращения зависания клапанов (из-за резко увеличивающихся ускорений) приходится ставить усиленные пружины. Поэтому, решившись на такую переделку, придется чаще проверять клапанные зазоры и менять цепь или ремень привода распредвала.\nА вот ставить распредвал с резко расширенными фазами впуска-выпуска на машину 'на каждый день' не стоит. Дело даже не в значительном повышении расхода топлива из-за того, что фазы впуска и выпуска накладываются друг на друга, в результате чего часть свежего заряда просто вылетает в трубу. У такого двигателя максимальная мощность возрастает, но 'внизу' мотор просто умирает, его надо постоянно крутить до максимума, а на обгонах приходится или переходить на три передачи вниз, или жечь сцепление. Единственное, чем можно себя потешить - резким стартом с дымом резины: у таких моторов просто сумасшедший подхват. Согласитесь, что это небольшая компенсация за увеличенный (иногда в два и более раз) расход бензина, снизившиеся надежность и ресурс, и необходимость мириться с тем, что придется постоянно держать руку на рычаге коробки передач.\nБолее радикальная механическая переделка - расточка головки цилиндров. При этом увеличивают проходные сечения впускных и выпускных каналов и устанавливают клапаны с увеличенным диаметром тарелок. Из-за возрастания массы клапанов нагрузки на привод механизма газораспределения, конечно, увеличиваются, но не в такой степени, как при непомерном увеличении поднятия клапанов (спортивный распредвал). С точки зрения эффективности этот способ поднятия мощности превосходит все описанные выше методы улучшения газообмена.\nДополнительно облегчают дыхание двигателю специальные настроенные впускные и выпускные системы. Дело в том, что воздух или топливная смесь на впуске и выхлопные газы на выпуске движутся неравномерно - в коллекторах возникают пульсации давления, вызванные движением поршней. Подбором длин и сечений труб можно добиться резонанса этих колебаний, который улучшает наполнение цилиндров двигателя и соответственно повышает мощность. Резонанс возникает лишь в узком диапазоне оборотов двигателя, обычно коллектор настраивают на самые 'верха', но иногда можно встретить системы, рассчитанные на частоты вращения коленвала, соответствующие максимальному значению крутящего момента.\nУ настроенных коллекторов - одинаковая длина патрубков каждого цилиндра (по этому признаку их можно отличить от обычных коллекторов). Из-за этого они выглядят причудливым переплетением труб. Для тюнинга применют спортивные 'пауки' и 'банки'.\nСвой вклад в уменьшение сопротивления на впуске, а значит, и в улучшение газообмена, вносят специальные фильтры нулевого сопротивления. Хорошо зарекомендовали себя комбинированные (поролон+бумажный элемент+тканевая шторка) фильтры KN. Они хороши тем, что помимо снижения сопротивления обладают большей степенью фильтрации, в результате чего увеличивается срок службы мотора. Да и срок службы такого фильтра больше, чем бумажного: засорился - снял, промыл - и вперед!\nК сожалению, улучшение газообмена приводит к повышению нагрузок на двигатель, как механических, так и тепловых. Снизить последние можно улучшением теплообмена. Самый простой способ - использование более густого масла - может помочь лишь в том случае, если мотор прошел не самую глубокую доработку или если его работа в предельных режимах будет крайне редка. В прочих же случаях приходится заменять радиаторы (масляный и водяной) на узлы с большей теплорассеивающей способностью.\nПовышенные механические нагрузки действуют в первую очередь на детали цилиндро-поршневой группы. И если блок цилиндров и коленвал имеют приличный запас прочности, то другим деталям достается по первое число. Особенно страдают поршни и кольца. Им и так приходится несладко, а тут резко возросшие ускорения из-за повышенных оборотов, большая тепловая нагрузка и главное - рост давления в цилиндрах. Из-за этого поршни часто прогорают, не выдержав и одной десятой того срока службы, на который были рассчитаны.\nкованые поршни двигателя - для чего нужны\nВ такой ситуации выход один: замена стандартных поршней на кованые, обладающие при той же массе большей жесткостью и меньшим тепловым расширением. Из кованых поршней среди профессионалов тюнинга хорошей репутацией пользуются изделия немецких Mahle и Goetze, а также нашего МАМИ. Экономить здесь не стоит - из-за особенностей технологии производства эти детали требуют намного более тщательного теплового расчета, нежели литые, и более дешевое изделие скорее всего заклинит.\nИмеет смысл установить специальные поршневые кольца, имеющие большую долговечность, нежели стандартные. Особенно хороши в этом смысле кольца L-образного сечения, обладающие лучшими уплотняющими свойствами (правда, они дороже) и позволяющие обойтись одним компрессионным кольцом, что снизит потери на трение.\nФОРСИРОВКА ДВИГАТЕЛЯ\nПеречисленные выше способы форсировки двигателя позволяют повысить его мощность раза в полтора. Если этого мало, придется принимать более радикальные меры.\nСамый простой способ повышения мощности двигателя - это увеличение его рабочего объема, т. н. форсирование по литражу. Больше объем - больше смеси сгорает - выше мощность. Но 'простой' в данном случае следует понимать как эффективный, но не буквально, поскольку переделывать или менять придется практически все основные детали, создавая новый мотор.\nрасточка блока цилиндров - один из способов увеличения объема двигателя\nДля повышения рабочего объема двигателя растачивают блок цилиндров, увеличивая их диаметр. Моторы, у которых блок отлит из легких сплавов, для этой процедуры не подходят - слишком мала толщина стенок. Кроме того, коэффициент теплового расширения алюминия довольно высок, и при малейшем перегреве, который весьма вероятен у форсированного мотора, постели коренных подшипников 'поплывут', подшипники потеряют соосность, и двигателю - конец.\nБолее пригодны для расточки чугунные блоки. Пределы увеличения диаметра цилиндров определяются минимально допустимой толщиной стенок гильз. Осталось подобрать подходящие поршни (а лучше - заготовки поршней, во избежание нестыковок с диаметром поршневого пальца), и - вперед!\nДля расточки нужен специальный станок, чтобы сохранить геометрию гильз и их взаимное расположение. Но станок - это не все. Для получения необходимого качества зеркала цилиндров после расточки их необходимо подвергнуть хонингованию. Процедура не слишком сложная, нужен хонинговальный станок и собственно хон - нечто вроде шлифовальной головки, которая создает на стенках цилиндров сетку перекрещивающихся под определенным углом микроцарапин, в которых при работе двигателя удерживается масло.\nВот с хоном нужного диаметра иногда могут быть проблемы. В этом случае вместо хонингования на том же станке можно выполнить притирку с помощью полировочной пасты, но результат будет не тот - без микроцарапин поверхность зеркала получится слишком гладкой, и смазка пары поршень-цилиндр ухудшится. Без применения высококачественных синтетических масел, образующих на поверхности более прочную, чем минеральные, пленку, в таком моторе уже не обойтись.\nПомимо замены поршней и колец - расточка блока подразумевает корректировку формы и объема камер сгорания в головке - для того, чтобы они соответствовали изменившимся габаритам и форме днищ поршней. По ходу дела можно и 'поджать' головку блока. При этом повысится степень сжатия и дополнительно вырастет мощность, но придется переходить на более высокооктановый бензин.\nПовысить отзывчивость мотора можно, уменьшив инерцию кривошипно-шатунного механизма, для этого его надо облегчить, сняв 'лишний' металл с противовесов коленвала и с маховика (что дает облегченный маховик). Мощность двигателя при этом не увеличится, но раскручиваться до максимальных оборотов он будет быстрее. Правда, появится болезненная реакция на изменение нагрузки. Кроме того, возрастут вибрации двигателя. После такой операции необходимо провести тщательную динамическую балансировку коленвала, для маховика же достаточно и статической.\nДругой путь увеличения мощности двигателя - использование наддува, подачи горючей смеси в цилиндры под давлением. Может применяться самостоятельно или же в дополнение к увеличению рабочего объема. Суть та же, что и при расточке, - увеличение количества сгорающей смеси, но другим способом.\nмеханический нагнетатель автомобиля\nНаддув в зависимости от величины давления принято делить на частичный (до 0,35 атм.), полный (0,35-1,0 атм.) и высокий (свыше 1,0 атм.). Иногда делят на наддув низкого и высокого давления. Величину давления чаще всего измеряют в барах (1 бар почти равен 1 атм.)."
}