{
  "data": "УЛУЧШЕНИЕ УПРАВЛЯЕМОСТИ И ВНЕШНЕГО ВИДА.\nДвигатель форсирован, коробка подобрана, тормоза усилены. Можно выстреливать на улицу... Не торопитесь. Ваше чудо техники способно ездить хоть и быстро, но пока только по прямой. Для придания машине соответствующей управляемости придется заняться ходовой частью, в первую очередь - подвеской.\nБоже упаси увлечься улучшением кинематики подвески MacPherson. Придется чтить золотое правило механика, гласящее: 'Не мешай машине нормально работать'. Улучшение характеристик подвески может идти только в одном направлении: устранение компромиссов, на которые конструкторам пришлось пойти ради обеспечения пассажирам должного комфорта. Когда стоит выбор - комфорт или возможность лучше держать дорогу - удобствами придется пожертвовать.\nамортизаторы для тюнинга с регулировкой отбоя\nПервое, что придется сделать - заменить стандартные амортизаторы на более жесткие спортивные. Они, как правило, газонаполненные, и более стабильно работают при длительных нагрузках. Кроме того, у таких амортизаторов чаще всего можно регулировать сопротивление сжатию и отбою. Процедура настройки зависит от модели амортизатора - некоторые приходится для этого каждый раз снимать с машины, а самые сложные (соответственно, дорогие) можно регулировать кнопками с места водителя. Существуют и компромиссные варианты типа Monroe Sensatrac, у которых характеристики в некоторых пределах меняются автоматически в зависимости от режима передвижения.\nУлучшению управляемости и повышению устойчивости автомобиля в поворотах способствуют более жесткие пружины подвески. Последнее слово в этой области - двухсекционные узлы, состоящие из двух пружин: сверхжесткой верхней и мягкой нижней. Это решение улучшает контакт колеса с дорогой: разгруженное в повороте колесо не 'зависает' над поверхностью, а под воздействием нижней пружины прижимается к асфальту.\nДля того, чтобы уменьшить крен машины, ведущий к 'зависанию' колес в повороте, устанавливают новые, более жесткие стабилизаторы поперечной устойчивости. При их установке значительно 'ужесточается' работа всей подвески. Если готовы это стерпеть, можно пойти дальше - заменить резинометаллические шарниры подвески на стальные сферические. Это значительно повысит управляемость, вот только существенно снизит комфорт.\nнизкопрофильные шины что это такое\nНе забудьте о колесах. Придется столкнуться с альтернативой: комфорт или управляемость. Спортивные низкопрофильные шины отлично держат дорогу, но на колдобинах сердце снижают комфорт. Особенно если такие покрышки (серии 50, а то и ниже) установлены на дорогущих 16-, 17- или 18-дюймовых кованых дисках. Литые подешевле, но при попадании колеса в хорошую яму на большой скорости алюминиевый диск может расколоться.\nНе всегда благоприятно влияет на управляемость увеличение ширины шины. На сухом асфальте широкая резина лучше. Но в дождь намного хуже из-за эффекта аквапланирования. Кроме того, более широкое колесо - это увеличенное плечо обкатки, а значит, повышенная нагрузка на подшипники ступицы и изменение кинематики подвески со всеми вытекающими последствиями.\nБывают случаи, когда на изменение геометрии подвески можно пойти. Такие варианты предлагают тюнинговые конторы, непосредственно связанные с заводом-изготовителем 'основы' (например, немецкий AMG) и использующие заводские наработки по 'оспортивливанию' поведения автомобиля на дороге. Правда, подобных предложений немного и стоят они недешево. Еще дороже стоит 'пересадка' всей подвески от более мощного и скоростного автомобиля. В этом случае уже не обойтись без такой трудоемкой и дорогостоящей операции, как вваривание в стандартный каркас кузова кронштейнов от 'донора'.\nкаркас безопасности гоночного автомобиля\nЧаще всего силовую структуру кузова переделывать не обязательно, можно ограничиться установкой распорки на кронштейны стоек передней подвески.\nТакие узлы выпускаются многими тюнинговыми ателье, стоят недорого, а эффект, получаемый с их помощью, достаточно велик. В случае радикального тюнинга, сопряженного с многократным увеличением мощности, скорее всего придется заняться усилением несущей основы кузова. Чаще всего это косынки и распорки, места установки которых подсказаны раллийным опытом эксплуатации данной модели автомобиля. Можно пойти и дальше, установив трубчатые усилители днища. Самым экстремальным решением является вварной каркас безопасности, подобный гоночному, но его применение вряд ли можно рекомендовать для машины повседневной эксплуатации.\nПолучившийся после всех переделок 'волк в овечьей шкуре' внешне от оригинала отличаться почти не будет. Но если не прочь придать автомобилю еще внешнюю индивидуальность - к вашим услугам множество наборов, позволяющих изменить (радикально или не слишком) дизайн машины. Причем зачастую такие узлы и детали могут прямо или косвенно влиять на ее ходовые качества.\nХороший пример - аэродинамический обвес: спойлеры, юбки, антикрылья, дефлекторы. Эти пластиковые детали, помимо придания машине более спортивного облика, увеличивают прижимающую силу, действующую на колеса. Некоторые из них - передний и задний спойлеры, накладки, сглаживающие переходы кузовных деталей - способствуют снижению аэродинамического сопротивления. Но только в том случае, когда обвес был профессионально проработан в аэродинамической трубе. Особенно это справедливо для задних спойлеров, изменение расположения которых на какие-то пару сантиметров может дать результат, противоположный желаемому.\nантикрыло для тюнинга автомобилей\nЕще один способ снижения лобового сопротивления кузова - это так называемый чопперинг (от английского chop - рубить), - понижение уровня крыши с помощью укорачивания стоек. Операция эта, несмотря на внешнюю простоту, крайне трудоемкая - практически речь идет о новом верхе, скроенном с использованием кусков старого. При этом не забудьте о проблеме 'обрезания' стекол. А главное, такая 'перестройка' верха кузова приводит к уменьшению жизненного пространства в салоне и снижению прочности несущей структуры - любой сварной шов уменьшает прочность узла по сравнению с цельной деталью.\nЗаботясь о ходовых качествах машины, не стоит забывать о комфорте. Скрасить пребывание в автомобиле, лучше почувствовать его - помогут фирмы, выпускающие аксессуары для оснащения салона: спортивные сиденья, рулевые колеса, набалдашники на рычаг КПП... Выбор зависит от финансовых возможностей и представлений об эргономике водительского места.\nспортивный руль на авто\nНесколько слов о безопасности. Допустить ошибку, управляя тюнингованным автомобилем, намного проще, чем сидя за рулем заурядной машины, до опасных скоростей практически не разгоняющейся. Лучше, если ремни безопасности будут спортивными четырехточечными. Не помешает система аварийного пожаротушения в любом виде: от полноценной, омологированной FIA для гоночных автомобилей до простого подкапотного огнетушителя, автоматически срабатывающего при повышении температуры.\nНа повышение безопасности 'работают' и более мощные, правильно отрегулированные фары головного света, прожекторы и противотуманки. Не вредно дополнительно выделить машину в потоке. Например, за счет раскраски или обклейки пленкой. Какие методы использовать при 'накручивании' машины - решать вам."
}