{
  "data": "Чтобы обеспечить высокое давление наддува потребуется компрессор. Он может приводиться механической передачей от коленвала или установленной на том же валу турбиной, размещенной в выпускном тракте. Первый вариант обычно называют механическим нагнетателем (supercharger), второй - турбокомпрессором (turbocharger).\nТурбонагнетатели конструктивно проще, но не без недостатков - сложность регулировки давления, медленный отклик на нажатие педали газа, невысокая долговечность, требовательность к качеству масла. Механические нагнетатели сложнее, но перечисленных недостатков не имеют. Основное достоинство - мгновенный отклик, кроме того, более ровная характеристика крутящего момента и прирост мощности преимущественно на низких и средних частотах вращения двигателя, что благотворно сказывается на его эластичности.\nПри высоких давлениях наддува возникает проблема снижения плотности свежего заряда. Дело в том, что заталкиваемая нагнетателем в цилиндры под давлением смесь перегревается, из-за теплового расширения снижается ее плотность, уменьшается количество кислорода, подаваемого в цилиндры, и двигатель теряет мощность. За что боролись? Чтобы спасти положение придется ставить интеркулер - промежуточный охладитель наддуваемого воздуха - типа 'воздух-воздух' или 'вода-воздух' (как бы радиатор наоборот).\nтурбонагнетатель\nЕще одно малоприятное явление при использовании наддува - это повышение степени сжатия, пропорциональное корню квадратному из величины давления наддува. Так, если на двигатель со степенью сжатия 8,5 установить наддув с давлением 2,25 атм., фактическая степень сжатия составит 12,75. Тут даже 98-й бензин будет детонировать. А ведь такое давление - не предел.\nВыхода два. Первый - снижение начальной степени сжатия - приводит к потере мощности. Второй - использование другого топлива. Топлива, обеспечивающие отсутствие детонации при степени сжатия 17-18, готовятся специально и содержат в своем составе такие компоненты, как метанол, бензол, ацетон. Или взять такую взрывоопасную жидкость, как нитрометан! Но это - совершеннейшая экзотика, удел соревнований категории Top Fuel. Мы до этого еще не доросли.\nПоследний способ радикального улучшения скоростных и динамических характеристик машины - установка нового, более мощного мотора.\nГлавное 'но' при этом - такие агрегаты обычно тяжелее стандартных, что резко ухудшает управляемость автомобиля. Кроме того, перед такой трансплантацией нелишне выяснить, поместится ли новый агрегат в моторный отсек. Рассчитывать перекомпоновку подкапотного пространства с изменившимися точками крепления мотора желательно не 'методом тыка'. А заодно невредно прикинуть, как вы потом будете вносить изменения в техпаспорт автомобиля - эта задачка может сложнее любых изменений под капотом.\nТЮНИНГ ТРАНСМИССИИ И ТОРМОЗОВ\nВы - обладатель мотора, имеющего намного большую мощность, нежели стандартный. Можно наслаждаться визгом дымящихся покрышек при резком старте? Погодите радоваться - в машине все взаимосвязано. И увеличившаяся мощность двигателя тяжким бременем ложится на трансмиссию, которая дополнительной нагрузки может и не выдержать.\nА как выяснить, на что способна трансмиссия вашего автомобиля - коробка, ведущий мост или мосты? Для этого следует знать основной параметр трансмиссии: ее т. н. проходной момент. До тех пор, пока он по величине больше или равен крутящему моменту двигателя, - все в порядке. Причины для беспокойства появляются, когда максимальный крутящий момент двигателя превосходит проходной момент коробки. Незначительное превышение лишь сокращает ресурс коробки. Но если оно достигает полутора раз, шестерни будут работать практически без запаса прочности и о ресурсе можно забыть.\nЕсли крутящий момент двигателя превышает проходной момент коробки более чем в полтора раза - придется заняться заменой коробки или хотя бы ее начинки: шестерен, валов. В противном случае есть риск просто 'порвать' трансмиссию.\nспортивное сцепление\nВнимательно придется отнестись к выбору сцепления для тюнинга. Ему приходится не только передавать мощность от мотора к трансмиссии, но и играть роль демпфера, смягчающего рывки при переключении передач и резком разгоне или торможении двигателем. Проходной момент сцепления задан довольно жестко - он должен составлять от 1,05 до 1,3 максимального крутящего момента двигателя. Поставишь слабую корзину - неминуема пробуксовка сцепления, а более мощная не будет сглаживать рывки, что приведет к повышенным ударным нагрузкам в трансмиссии и, соответственно, приблизит ее кончину. Даже если сцепление подобрано правильно, при агрессивной езде пробуксовка муфты неизбежна, а если вы еще и любитель не сбрасывать газ при манипулировании коробкой... В таких случаях незаменимыми оказываются металлокерамические диски сцепления.\nКак видим, в случае форсировки мотора необходима ревизия трансмиссии, а замена сцепления - просто неминуема. А раз приходится идти на крайние меры, напрашивается вопрос: а не усовершенствовать ли попутно трансмиссию, сделав ее более приспособленной к спортивному стилю вождения?\nГонки выигрывает тот, кто быстрее переключает передачи. Конечно, городские улицы - не гоночная трасса, но возможность более быстрого переключения передач может пригодиться, если не прочь пожертвовать плавностью хода. Для этого придется заменить синхронизаторы в коробке на кулачковые муфты, которые позволяют намного сократить промежутки времени, необходимые для перехода с одной передачи на другую. Кроме того, более компактные габариты муфт по сравнению с синхронизаторами в большинстве случаев дают возможность втиснуть в коробку еще одну пару шестерен и сделать таким образом из пятиступенчатой трансмиссии - шестиступенчатую.\nЕсли вы решитесь на замену начинки коробки, самое время подумать и об изменении передаточных чисел, которые можно индивидуально подобрать под конкретный стиль вождения. Наиболее подходящим видится такой вариант: три первые передачи короткие, для быстрого отрыва со светофора, а остальные - длинные, для спокойного передвижения по прямому шоссе. Это - дело вкуса, как и выбор алгоритма переключения передач при основательной переделке привода коробки. Многим представляется удобным последовательное переключение, как на мотоцикле: повышенную - вперед, пониженную - назад. Но такой вариант неприемлем, если вы перед поворотом любите перейти на пару-тройку передач вниз.\nтипы дифференциалов автомобиля\nЕсли вы - любитель проходить повороты с визгом шин, явно нелишней покажется замена стандартного дифференциала на дисковый или кулачковый, так называемые дифференциалы повышенного трения. Их изюминка - в наиболее рациональном распределении крутящего момента по колесам, что позволяет лучше контролировать автомобиль даже при вывешивании колеса в повороте и пройти его с большей скоростью. В этом и заключается задача любого тюнинга трансмиссии - обеспечить наиболее полную реализацию возможностей двигателя.\nСвой вклад вносят тормоза. Чем выше мощность рабочих тормозных механизмов, тем позже можно сбросить газ при входе в поворот, а следовательно - добиться большей средней скорости на дистанции. Да и требования безопасности, предъявляемые к динамичному форсированному автомобилю, намного выше, чем к простой машине.\nСамый эффективный метод повышения тормозной динамики - полная замена стандартной системы, от главного тормозного цилиндра и суппортов рабочих механизмов до дисков. Существует много фирм, предлагающих подобные тюнинговые комплекты, стоящие немалых денег.\nНо впихнуть на место увеличенные тормозные диски не всегда удается без увеличения диаметра колес, а последнее иногда бывает нежелательным из соображений сохранения стандартной внешности автомобиля.\nдисковые тормоза для автомобиля\nПовысить эффективность торможения малой кровью - за счет модернизации существующей системы - вряд ли удастся, уж слишком радикальные предстоят переделки. В первую очередь необходимо заменить задние барабанные тормозные механизмы на дисковые. При этом передние механизмы должны оставаться эффективнее задних во избежание блокировки последних. Можно заменить суппорты на более мощные или, скажем, установить на один диск по два суппорта, изготовив дополнительные кронштейны. При этом никуда не уйти от замены главного тормозного цилиндра на новый, с большей производительностью.\nРазумеется, при агрессивном вождении тормозная система работает с повышенной нагрузкой. Следовательно, неизбежен перегрев дисков, снижающий, причем резко, эффективность торможения. Выход один - установка вентилируемых тормозных дисков. Но даже самые эффективные трансмиссия и тормоза управляемость автомобиля улучшают ненамного. Чтобы машина стала более послушной не обойтись без изменений в ходовой части."
}